# 2) მომხმარებელს შემოაყვანინე სამი რიცხვი, ხოლო პროგრამამ დაბეჭდოს მათი საშუალო არითმეტიკული.

# 3) მომხმარებელს შემოატანინე ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 4) input ფუნქციის საშუალებით შემოიყვანეთ თქვენი და თქვენი ოჯახის წევრების სახელები და დაპრინტეთ ერთი დიდი წინადადება კონკატენაციის სახით.

# 5) მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). მაგ. city = "Tbilisi", District = "{თქვენი უბანი}" და ა.შ. საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

# 6) მომხმარებელს შემოატანინეთ ასაკი და ამოყენებითმსგავსი ფორმატის წინადადება: 
# "You are ასაკი years old".

#2) სამი რიცხვის საშუალო არითმეტიკული
num1 = float(input("შეიყვანე პრიველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი: "))
num3 = float(input("შეიყვანე მესამე რიცხვი: "))

average = (num1 + num2 + num3) / 3

print("საშუალო:", average)

#3) ორი რიცხვის ჯამი
num1 = float(input("შეიყვანე პირველი რიცხვი: "))
num2 = float(input("შეიყვანე მეორე რიცხვი "))

sum = num1 + num2

print('ჯამი:' , sum)

#4) კონკატინაცია
my_name = input("ჩემი სახელი: ")
mother = input("ჩემი დედის სახელი: ")
father = input("ჩემი მამის სახელი: ")
sibling = input("ჩემი და-ძმის სახელი: ")

sentence = my_name + " ცხოვრობს " + mother + ", " + father + " და " + sibling + 'თან' + '.'

print(sentence)

#5) სრული მისამართის გამოტანა
city = input("შეიყვანე შენი ქალაქი: ")
district = input("შეიყვანე შენი რაიონი: ")
building = input("შეიყვანე შენი ბინის ნომერი: ")
floor = input("შეიყვანე შენი სართლი: ")

print("ჩემი ადრესია:", city + ", " + district + ", შენობა " + building + ", სართული " + floor)

#6) ასაკის შეყვანა
age = input("შეიყვანე შენი ასაკი: ")

print("მე ვარ" + age + "წლის")
print('you are + age + years old')

