# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# 3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.

# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.

# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.





# 2) # input - არის ფუნქცია, რომელიც საშუალებას აძლევს მომხმარებელს შეიყვანოს მონაცემები კლავიატურიდან.
# მაგალითი:
name = input("enter your name:")
# output - არის პროცესი, როდესაც პროგრამა გამოიტანს ინფორმაციას ეკრანზე (ძირითადად print() ფუნქციით).
# მაგალითი:
print("hello goa")

# 3) input ყოველთვის აბრუნებს სტრიქონს (str)
user_data = input("enter anything: ")
data_type = type(user_data)
print("თქვენ მიერ შემოტანილი მნიშვნელობაა:", user_data)
print("მისი მონაცემთა ტიპია:", data_type) 

# 4)
str1 = "w_speed"            #string
str2 = "w_shavidze"         #string
int1 =  123                 #integer
int2 = 45                   #integer
float3 = 6.7                #float

# 5) # String (str) - ტექსტური ტიპი
s1 = "Python"
print(type(s1))

# Integer (int) - მთელი რიცხვი
i1 = 10      
print(type(i1))


# Float (float) - ათწილადი რიცხვი
f1 = 10.5     

print(type(f1))

# 6) 
name = input("type smt")
surname = input("just type smt")
result = name + " " + surname  #კონკატინაცია string + string
print("შედეგი:", result)

# 7) 
num1 = int(input("შეიყვანეთ I რიცხვი: "))
num2 = int(input("შეიყვანეთ II რიცხვი: "))
num3 = int(input("შეიყვანეთ III რიცხვი: "))
num4 = int(input("შეიყვანეთ IV რიცხვი: "))
num5 = int(input("შეიყვანეთ V რიცხვი: "))

average = (num1 + num2 + num3 + num4 + num5) / 5
print("საშუალო არითმეტიკული არის:", average)

# 8) 
name = input("სახელი: ")
last_name = input("გვარი: ")
age = input("ასაკი: ")
height = input("სიმაღლე: ")
weight = input("წონა: ")

print("გამარჯობა, მე ვარ" + " " + name + " " + last_name + " " + age + " " + "წლის." "ჩემი სიმაღლეა" + " " + height + "სმ," "ხოლო წონა" + " " + weight + "კგ.")





