# 2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

# 3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

# 4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

# 5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

# 6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

# 7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.




#2.
# ==  (ტოლობა): 
# !=  (არ უდრის):
# >   (მეტობა)
# <   (ნაკლებობა)
# >=  (მეტობა ან ტოლობა)
# <=  (ნაკლებობა ან ტოლობა)


# ==
print(10 == 10)  
print(25 == 25)
print(26 == 27)
print(123 == 123)
print(535 == 35)
# !=
print(5 != 3)
print(12 != 32)
print(123 != 54)
print(14124 != 12414)
print(34 !=3423)
# >
print(15 > 20)  
print(123 > 313)
print(123 > 3535)
print(837 > 343)
print(132 > 123)
# <
print(123 < 123)
print(2892 < 123)
print(1343 < 123)
print(39398 < 439459)
print(9282 < 2312)
#<=
print(574 <= 43432)
print(3874 <= 2312)
print(3948 <= 43434)
print(32 <= 34)
print(8 <= 8)    
#>=
print(323 >= 2131)
print(23723 >= 123)
print(23732 >= 4343)
print(374 >= 34)
print(3478 >= 3434)
#3.


# 1. and (და): აბრუნებს True-ს მხოლოდ მაშინ, თუ ორივე პირობა ჭეშმარიტია. ანუ უპირატესობას false-ს ანიჭებს.
# 2. or (ან): აბრუნებს True-ს, თუ ერთ-ერთი პირობა მაინც ჭეშმარიტია. ანუ უპირატესობას true-ს ანიჭებს.

#4.

# and
print(False and False)
print(True and True)
print(True and False)
# or
print(True or True)
print(False or False)
print(True or False)
#5.

number_lesgo = 25
print(number_lesgo > 25)
#6.

name1 = "nikoloz mania"
name = input("შეიყვანე სახელი: ")
print(name == name1)
#7.
ur_age = int(input("შენი ასაკი: "))
print(ur_age > 18)